Autodesk.Revit.DB.Mechanical.AirSystemData.ChilledWaterLoopId
The chilled water loop used for the chilled water option of cooling coil.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.Mechanical.AirSystemData.HeatingHotWaterLoopId
The water loop element id for the hot-water heating coil.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.Mechanical.AirSystemData.PreheatHotWaterLoopId
The water loop element id for the hot-water preheat coil.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020.1